apps/contributions/tests/fixtures/stripe-subscription-retrieve.json

{
    "id": "sub_fakefakefake11111",
    "object": "subscription",
    "application": "ca_JGxDCnO08VRFiIKWUuBfOmOx70wFiBW0",
    "application_fee_percent": null,
    "automatic_tax": {
        "enabled": false
    },
    "billing_cycle_anchor": 1675925670,
    "billing_thresholds": null,
    "cancel_at": null,
    "cancel_at_period_end": false,
    "canceled_at": null,
    "collection_method": "charge_automatically",
    "created": 1675925670,
    "currency": "usd",
    "current_period_end": 1678344870,
    "current_period_start": 1675925670,
    "customer": "cus_fakefake22222",
    "days_until_due": null,
    "default_payment_method": "pm_fakefake333333",
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "ended_at": null,
    "items": {
        "object": "list",
        "data": [
            {
                "id": "si_fakefake3444444",
                "object": "subscription_item",
                "billing_thresholds": null,
                "created": 1675925670,
                "metadata": {},
                "plan": {
                    "id": "price_fakefaakefake333543543",
                    "object": "plan",
                    "active": false,
                    "aggregate_usage": null,
                    "amount": 18000,
                    "amount_decimal": "18000",
                    "billing_scheme": "per_unit",
                    "created": 1675925670,
                    "currency": "usd",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {},
                    "nickname": null,
                    "product": "prod_fakefakefakef9393939",
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "price": {
                    "id": "price_fakefaakefake333543543",
                    "object": "price",
                    "active": false,
                    "billing_scheme": "per_unit",
                    "created": 1675925670,
                    "currency": "usd",
                    "custom_unit_amount": null,
                    "livemode": false,
                    "lookup_key": null,
                    "metadata": {},
                    "nickname": null,
                    "product": "prod_fakefakefakef9393939",
                    "recurring": {
                        "aggregate_usage": null,
                        "interval": "month",
                        "interval_count": 1,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "tax_behavior": "unspecified",
                    "tiers_mode": null,
                    "transform_quantity": null,
                    "type": "recurring",
                    "unit_amount": 18000,
                    "unit_amount_decimal": "18000"
                },
                "quantity": 1,
                "subscription": "sub_fakefakefake11111",
                "tax_rates": []
            }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_fakefakefake11111"
    },
    "latest_invoice": "in_fakefakke999999",
    "livemode": false,
    "metadata": {
        "agreed_to_pay_fees": "False",
        "contributor_id": "147",
        "donor_selected_amount": "180.0",
        "referer": "https://foo.bar.org/donate/",
        "revenue_program_id": "1",
        "revenue_program_slug": "foobar",
        "schema_version": "1.1",
        "source": "bizz-bang",
        "swag_opt_out": "False"
    },
    "next_pending_invoice_item_invoice": null,
    "on_behalf_of": null,
    "pause_collection": null,
    "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "on_subscription"
    },
    "pending_invoice_item_interval": null,
    "pending_setup_intent": null,
    "pending_update": null,
    "plan": {
        "id": "price_fakefaakefake333543543",
        "object": "plan",
        "active": false,
        "aggregate_usage": null,
        "amount": 18000,
        "amount_decimal": "18000",
        "billing_scheme": "per_unit",
        "created": 1675925670,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": null,
        "product": "prod_fakefakefakef9393939",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
    },
    "quantity": 1,
    "schedule": null,
    "start_date": 1675925670,
    "status": "active",
    "test_clock": null,
    "transfer_data": null,
    "trial_end": null,
    "trial_settings": {
        "end_behavior": {
            "missing_payment_method": "create_invoice"
        }
    },
    "trial_start": null
}
